MusaMahmood/nRF52_GSR_ADS1220/main.c
  err_code = nrf_drv_saadc_channel_init(0, &channel_config);
  APP_ERROR_CHECK(err_code);

  if (SAADC_BURST_MODE) {
    NRF_SAADC->CH[0].CONFIG |= 0x01000000; //Configure burst mode for channel 0. Burst is useful together with oversampling. When triggering the SAMPLE task in burst mode, the SAADC will sample "Oversample" number of times as fast as it can and then output a single averaged value to the RAM buffer. If burst mode is not enabled, the SAMPLE task needs to be triggered "Oversample" number of times to output a single averaged value to the RAM buffer.
  }

  err_code = nrf_drv_saadc_buffer_convert(&m_buffer_pool[0], SAMPLES_IN_BUFFER);
  APP_ERROR_CHECK(err_code);

  //  err_code = nrf_drv_saadc_buffer_convert(m_buffer_pool[1], SAMPLES_IN_BUFFER);
  //  APP_ERROR_CHECK(err_code);

  nrf_drv_saadc_calibrate_offset(); //Calibrate before initialization.
}
#endif

static void wait_for_event(void) {
  (void)sd_app_evt_wait();
}

void drdy_pin_handler(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action) {
  UNUSED_PARAMETER(pin);
  UNUSED_PARAMETER(action);

  m_drdy_pin_handler = true;
}

static void ads1220_gpio_init(void) {
  nrf_gpio_pin_dir_set(ADS1220_DRDY_PIN, NRF_GPIO_PIN_DIR_INPUT);
  uint32_t err_code;
  if (!nrf_drv_gpiote_is_init()) {
    err_code = nrf_drv_gpiote_init();
  }
  NRF_LOG_RAW_INFO(" nrf_drv_gpiote_init: %d\r\n", err_code);
  NRF_LOG_FLUSH();
  APP_ERROR_CHECK(err_code);
  bool is_high_accuracy = true;
  nrf_drv_gpiote_in_config_t in_config = GPIOTE_CONFIG_IN_SENSE_HITOLO(is_high_accuracy);
  in_config.is_watcher = true;
  in_config.pull = NRF_GPIO_PIN_NOPULL;
  err_code = nrf_drv_gpiote_in_init(ADS1220_DRDY_PIN, &in_config, drdy_pin_handler);
  NRF_LOG_RAW_INFO(" nrf_drv_gpiote_in_init: %d: \r\n", err_code);
  NRF_LOG_FLUSH();
  APP_ERROR_CHECK(err_code);
  nrf_drv_gpiote_in_event_enable(ADS1220_DRDY_PIN, true);
}

#if defined(APP_SDCARD_ENABLED) && APP_SDCARD_ENABLED == 1
static void fatfs_write(void) {
  // TODO: INIT:
  static FATFS fs;
  static DIR dir;
  static FILINFO fno;

  FRESULT ff_result;
  DSTATUS disk_state = STA_NOINIT;

  // Initialize FATFS disk I/O interface by providing the block device.
  static diskio_blkdev_t drives[] =
      {
          DISKIO_BLOCKDEV_CONFIG(NRF_BLOCKDEV_BASE_ADDR(m_block_dev_sdc, block_dev), NULL)};

  diskio_blockdev_register(drives, ARRAY_SIZE(drives));

  NRF_LOG_INFO("Initializing disk 0 (SDC)...\r\n");
  for (uint32_t retries = 3; retries && disk_state; --retries) {
    disk_state = disk_initialize(0);
  }
  if (disk_state) {
    NRF_LOG_INFO("Disk initialization failed.\r\n");
    return;
  }

  uint32_t blocks_per_mb = (1024uL * 1024uL) / m_block_dev_sdc.block_dev.p_ops->geometry(&m_block_dev_sdc.block_dev)->blk_size;
  uint32_t capacity = m_block_dev_sdc.block_dev.p_ops->geometry(&m_block_dev_sdc.block_dev)->blk_count / blocks_per_mb;
  NRF_LOG_INFO("Capacity: %d MB\r\n", capacity);

  NRF_LOG_INFO("Mounting volume...\r\n");
  ff_result = f_mount(&fs, "", 1);
  if (ff_result) {
    NRF_LOG_INFO("Mount failed.\r\n");
    return;
  }

  NRF_LOG_INFO("\r\n Listing directory: /\r\n");
  ff_result = f_opendir(&dir, "/");
  if (ff_result) {
    NRF_LOG_INFO("Directory listing failed!\r\n");
    return;
  }

  do {
    ff_result = f_readdir(&dir, &fno);
    if (ff_result != FR_OK) {
      NRF_LOG_INFO("Directory read failed.");
      return;
    }

    if (fno.fname[0]) {
      if (fno.fattrib & AM_DIR) {
        NRF_LOG_RAW_INFO("   <DIR>   %s\r\n", (uint32_t)fno.fname);
      } else {
        NRF_LOG_RAW_INFO("%9lu  %s\r\n", fno.fsize, (uint32_t)fno.fname);
      }
    }
  } while (fno.fname[0]);
  NRF_LOG_RAW_INFO("\r\n");
  //TODO: Write:
  static FIL file; 
  uint32_t bytes_written; 

  NRF_LOG_INFO("Writing to file " FILE_NAME "...\r\n");
  ff_result = f_open(&file, FILE_NAME, FA_READ | FA_WRITE | FA_OPEN_APPEND);
  if (ff_result != FR_OK) {
    NRF_LOG_INFO("Unable to open or create file: " FILE_NAME ".\r\n");
    return;
  }
  // Write array:
  ff_result = f_write(&file, fatfs_buffer_array, FATFS_BUFFER_SIZE, (UINT *)&bytes_written);
  if (ff_result != FR_OK) {
    NRF_LOG_INFO("Write failed\r\n.");
  } else {
    NRF_LOG_INFO("%d bytes written.\r\n", bytes_written);
  }

  (void)f_close(&file);
  //TODO: Uninit: 
  disk_state = disk_uninitialize(0);
  NRF_LOG_INFO("Disk UNinitialized.\r\n");

}

#endif

/**@brief Function for application main entry.
 */
int main(void) {
  bool erase_bonds = false;
  uint32_t err_code = NRF_SUCCESS;
  // Initialize.
  log_init();
  timers_init();
  ble_stack_init();
  ads1220_gpio_init();
  gap_params_init();
  gatt_init();
  advertising_init();
  services_init();
  conn_params_init();
  m_sg.sg_ch1_count = 0;
  m_sg.sg_ch2_count = 0;
  // ADS1220 Functions:
  //Reset?
  ads_spi_init();
  ads1220_reset();              // Reset to ensure device is properly working
  ads1220_init_default_regs();  // Write default registers
  ads1220_check_written_regs(); //Sanity Check. Dump written registers
  ads1220_start_sync();         // start converting in continuous mode
// Wait for DRDY.
#if defined(SAADC_ENABLED) && SAADC_ENABLED == 1
  saadc_init();
#endif
// AD5242 Init:
  uint8_t ad5242_rdac_val = 128; // 128 ~= 500kO
  ad5242_twi_init(m_twi);
  ad5242_write_rdac1_value(m_twi, ad5242_rdac_val);
//  ad5242_twi_uninit(m_twi);
  // Initialize TMP Sensor:
  tmp116_twi_init(m_twi1);
  tmp116_set_mode(m_twi1);
  // Start execution.
  application_timers_start();
  advertising_start();
  NRF_LOG_RAW_INFO(" BLE Advertising Start! \r\n");
  NRF_LOG_FLUSH();
#if LEDS_ENABLE == 1
  nrf_gpio_pin_clear(LED_2); // Green
  nrf_gpio_pin_set(LED_1);   //Blue
#endif
// Enter main loop
#if NRF_LOG_ENABLED == 1
  while (1) {
    NRF_LOG_FLUSH();
    if (m_drdy_pin_handler) {
      // Get current timestamp
      uint32_t timer_data_ticks = app_timer_cnt_get(); 
      // Convert to ms:
      m_timestamp_ms = timer_data_ticks * ( 1000 ) / APP_TIMER_CLOCK_FREQ;
      #if defined(APP_SDCARD_ENABLED) && APP_SDCARD_ENABLED == 1
        memcpy_fast(&fatfs_buffer_array[fatfs_buffer_count], (uint8_t *) &m_timestamp_ms, sizeof(m_timestamp_ms) - 1);
        fatfs_buffer_count += (sizeof(m_timestamp_ms) - 1); // Last byte is always zero. 
      #endif 
      m_drdy_pin_handler = false;
      get_gsr_data(&m_sg);
      #if defined(APP_SDCARD_ENABLED) && APP_SDCARD_ENABLED == 1
        memcpy_fast(&fatfs_buffer_array[fatfs_buffer_count], &m_sg.sg_ch1_buffer[m_sg.sg_ch1_count - 3], 3);
        fatfs_buffer_count += 3;
      #endif
      if ( ( (m_sg.sg_ch1_count % 9) == 0) && m_sg.sg_ch1_count != 0) {
        m_calibration_flag = true;
        m_calibration_index = m_sg.sg_ch1_count - 3;
      }
      if (m_sg.sg_ch1_count == SG_PACKET_LENGTH) { // mode 2
        m_sg.sg_ch1_count = 0;
        if (m_connected) {
#if DEVICE_NUMBER == 1
          ble_sg_update_1ch(&m_sg);
#elif DEVICE_NUMBER == 2
          ble_sg_update_3ch(&m_sg);
#endif
        }
      }
      uint16_t sample = tmp116_read_data(m_twi1);
      #if defined(APP_SDCARD_ENABLED) && APP_SDCARD_ENABLED == 1
        memcpy_fast(&fatfs_buffer_array[fatfs_buffer_count], (uint8_t *)&sample, sizeof(sample));
        fatfs_buffer_count += sizeof(sample);
      #endif
      memcpy_fast(&m_sg.sg_ch2_buffer[m_sg.sg_ch2_count], (uint8_t *)&sample, sizeof(sample));
      m_sg.sg_ch2_count += 2;
      if (m_sg.sg_ch2_count == SG_PACKET_LENGTH_TMP) {
        m_sg.sg_ch2_count = 0;
        if (m_connected) {
#if DEVICE_NUMBER == 1
          ble_sg_update_2ch(&m_sg);
#elif DEVICE_NUMBER == 2
          ble_sg_update_4ch(&m_sg);
#endif
        }
      }
#if defined(APP_SDCARD_ENABLED) && APP_SDCARD_ENABLED == 1
      // TODO: Once buffer is full, run fatfs write protocol (shut off everything and write).
      if (fatfs_buffer_count == FATFS_BUFFER_SIZE) {
        fatfs_buffer_count = 0;
        //Disable SPI for ADS1220:
        ads1220_powerdown();
        ads_spi_uninit();
        //Disable TWI for TMP116:
        tmp116_twi_uninit(m_twi1);
        //Disable TWI for AD5242:
        ad5242_twi_uninit(m_twi); 
        //TODO: Init FATFS; Write; Disable FATFS
        fatfs_write();
        // Re-enable AD5242 & set to ad5242_rdac_val
        ad5242_twi_init(m_twi);
        ad5242_write_rdac1_value(m_twi, ad5242_rdac_val);
        // Re-enable TMP116
        tmp116_twi_init(m_twi1);
        tmp116_set_mode(m_twi1);
        // Re-enable ADS1220 and start cycle.
        ads_spi_init();
        ads1220_reset();              // Reset to ensure device is properly working
        ads1220_init_default_regs();  // Write default registers
        ads1220_start_sync();         // start converting in continuous mode
      }
    }
#endif
    if (m_calibration_flag) {
      m_calibration_flag = false;
      // Calibrate if out of range: Re-interpret 24-bit int as 32-bit int
      int32_t value = ((m_sg.sg_ch1_buffer[m_calibration_index] << 24) | (m_sg.sg_ch1_buffer[m_calibration_index + 1] << 16) | (m_sg.sg_ch1_buffer[m_calibration_index + 2] << 8)) >> 8;
      NRF_LOG_INFO("Current Value: %d \r\n", value);
      if (value < 409600 && !m_out_of_range_neg_flag) { // Out of range (V < 0.1)
        NRF_LOG_INFO("[LOW THRESHOLD] - Value out of range! : %d\r\n", value);
        m_out_of_range_neg_flag = true;
      }

      if (m_out_of_range_neg_flag) {
        if (ad5242_rdac_val != 255)
          ad5242_rdac_val++; // Increase resistance
        ad5242_write_rdac1_value(m_twi, ad5242_rdac_val);
        NRF_LOG_INFO("Updated RDAC Value to %d\r\n", ad5242_rdac_val);
        if (value > 2457600) // if > 0.6V, stop
          m_out_of_range_neg_flag = false;
      }

      if (value > 6512639 && !m_out_of_range_pos_flag) { // Out of range (V > 1.59)
        NRF_LOG_INFO("[HIGH THRESHOLD] - Value out of range! : %d\r\n", value);
        m_out_of_range_pos_flag = true;
      }

      if (m_out_of_range_pos_flag) {
        if (ad5242_rdac_val != 0)
          ad5242_rdac_val--; // Decrease resistance
        ad5242_write_rdac1_value(m_twi, ad5242_rdac_val);
        NRF_LOG_INFO("Updated RDAC Value to %d\r\n", ad5242_rdac_val);
        if (value < 4096000) // if < 1.0 V, stop
          m_out_of_range_pos_flag = false;
      }
    }
  }
#endif
}

/**
 * @}
 */